Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровАвтолавкой") Тогда
		Для Каждого ТекСтрокаСписокТоваров Из ДанныеЗаполнения.СписокТоваров Цикл
			НоваяСтрока = СписокТоваров.Добавить();
			НоваяСтрока.Количество = ТекСтрокаСписокТоваров.Количество;
			НоваяСтрока.Товар = ТекСтрокаСписокТоваров.Товар;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если Статус = Перечисления.СтатусПланаЗакупок.Отклонен Тогда
		Сообщить("Нельзя провести план со статусом " + Статус);
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

