
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Маршруты") Тогда
		// Заполнение шапки
		Маршрут = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТочкиОстановки Из ДанныеЗаполнения.ТочкиОстановки Цикл
			НоваяСтрока = ТочкиМаршрута.Добавить();
			НоваяСтрока.ТочкаМаршрута = ТекСтрокаТочкиОстановки.ТочкаОстановки;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
