
Процедура ОбработкаПроведения(Отказ, Режим)
	ТЗ = СписокТоваров.Выгрузить();
	ТЗ.Свернуть("Товар", "Количество");
	 
	Движения.Закупки.Записывать = Истина;
	Движения.ТоварыНаСкладе.Записывать = Истина;
	Для Каждого ТекСтрокаСписокТоваров Из ТЗ Цикл
		Движение = Движения.Закупки.Добавить();
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаСписокТоваров.Товар;
		Движение.Количество = ТекСтрокаСписокТоваров.Количество;
		
		Движение = Движения.ТоварыНаСкладе.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаСписокТоваров.Товар;
		Движение.Количество = ТекСтрокаСписокТоваров.Количество;
	КонецЦикла;

КонецПроцедуры
