
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровАвтолавкойСписокТоваров.Товар КАК Товар,
		|	СУММА(РеализацияТоваровАвтолавкойСписокТоваров.Количество) КАК Количество,
		|	РеализацияТоваровАвтолавкой.НомерПутевогоЛиста КАК НомерПутевогоЛиста
		|ПОМЕСТИТЬ ДокТЧ
		|ИЗ
		|	Документ.РеализацияТоваровАвтолавкой.СписокТоваров КАК РеализацияТоваровАвтолавкойСписокТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровАвтолавкой КАК РеализацияТоваровАвтолавкой
		|		ПО РеализацияТоваровАвтолавкойСписокТоваров.Ссылка = РеализацияТоваровАвтолавкой.Ссылка
		|ГДЕ
		|	РеализацияТоваровАвтолавкойСписокТоваров.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровАвтолавкойСписокТоваров.Товар,
		|	РеализацияТоваровАвтолавкой.НомерПутевогоЛиста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокТЧ.Товар КАК Товар,
		|	ДокТЧ.Количество КАК Количество,
		|	ДокТЧ.НомерПутевогоЛиста КАК НомерПутевогоЛиста
		|ИЗ
		|	ДокТЧ КАК ДокТЧ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Движения.ТоварыВАвтолавке.Записывать = Истина;
	Движения.ТоварыВАвтолавке.БлокироватьДляИзменения = Истина;
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ТоварыВАвтолавке.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = Выборка.Товар;
		Движение.Количество = Выборка.Количество;
		Движение.ПутевойЛист = Выборка.НомерПутевогоЛиста;
		
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Товар = Выборка.Товар;
		Движение.ПутевойЛист = Выборка.НомерПутевогоЛиста;
		Движение.Количество = Выборка.Количество;
	КонецЦикла;
	
	Движения.Записать();
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыВАвтолавкеОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ТоварыВАвтолавкеОстатки.Товар.Представление КАК ТоварПредставление,
		|	ТоварыВАвтолавкеОстатки.ПутевойЛист КАК ПутевойЛист
		|ИЗ
		|	РегистрНакопления.ТоварыВАвтолавке.Остатки(
		|			&Дата,
		|			Товар В
		|				(ВЫБРАТЬ
		|					ДокТЧ.Товар
		|				ИЗ
		|					ДокТЧ)) КАК ТоварыВАвтолавкеОстатки,
		|	Документ.РеализацияТоваровАвтолавкой КАК РеализацияТоваровАвтолавкой
		|ГДЕ
		|	ТоварыВАвтолавкеОстатки.КоличествоОстаток < 0
		|	И ТоварыВАвтолавкеОстатки.ПутевойЛист = РеализацияТоваровАвтолавкой.НомерПутевогоЛиста";
	
	Запрос.УстановитьПараметр("Дата", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	
	РезультатЗапроса = Запрос.Выполнить();
	ЕСЛИ НЕ РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;					
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщить("Мало товара " + ВыборкаДетальныеЗаписи.ТоварПредставление + ", необходимо еще " + (- ВыборкаДетальныеЗаписи.КоличествоОстаток))
		КонецЦикла;
		
	КонецЕсли;
	
	Движения.Продажи.Записать();

КонецПроцедуры
