
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровАвтолавкойСписокТоваров.Товар КАК Товар,
		|	СУММА(РеализацияТоваровАвтолавкойСписокТоваров.Количество) КАК Количество,
		|	РеализацияТоваровАвтолавкой.НомерПутевогоЛиста КАК НомерПутевогоЛиста
		|ПОМЕСТИТЬ ДокТЧ
		|ИЗ
		|	Документ.РеализацияТоваровАвтолавкой.СписокТоваров КАК РеализацияТоваровАвтолавкойСписокТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровАвтолавкой КАК РеализацияТоваровАвтолавкой
		|		ПО РеализацияТоваровАвтолавкойСписокТоваров.Ссылка = РеализацияТоваровАвтолавкой.Ссылка
		|ГДЕ
		|	РеализацияТоваровАвтолавкойСписокТоваров.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровАвтолавкойСписокТоваров.Товар,
		|	РеализацияТоваровАвтолавкой.НомерПутевогоЛиста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокТЧ.Товар КАК Товар,
		|	ДокТЧ.Количество КАК Количество,
		|	ДокТЧ.НомерПутевогоЛиста КАК НомерПутевогоЛиста
		|ИЗ
		|	ДокТЧ КАК ДокТЧ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Движения.ТоварыВАвтолавке.Записывать = Истина;
	Движения.ТоварыВАвтолавке.БлокироватьДляИзменения = Истина;
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ТоварыВАвтолавке.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = Выборка.Товар;
		Движение.Количество = Выборка.Количество;
		Движение.ПутевойЛист = Выборка.НомерПутевогоЛиста;
		
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Товар = Выборка.Товар;
		Движение.ПутевойЛист = Выборка.НомерПутевогоЛиста;
		Движение.Количество = Выборка.Количество;
	КонецЦикла;
	
	Движения.Записать();
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыВАвтолавкеОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ТоварыВАвтолавкеОстатки.Товар.Представление КАК ТоварПредставление,
		|	ТоварыВАвтолавкеОстатки.ПутевойЛист КАК ПутевойЛист
		|ИЗ
		|	РегистрНакопления.ТоварыВАвтолавке.Остатки(
		|			&Дата,
		|			Товар В
		|				(ВЫБРАТЬ
		|					ДокТЧ.Товар
		|				ИЗ
		|					ДокТЧ)) КАК ТоварыВАвтолавкеОстатки,
		|	Документ.РеализацияТоваровАвтолавкой КАК РеализацияТоваровАвтолавкой
		|ГДЕ
		|	ТоварыВАвтолавкеОстатки.КоличествоОстаток < 0
		|	И ТоварыВАвтолавкеОстатки.ПутевойЛист = РеализацияТоваровАвтолавкой.НомерПутевогоЛиста";
	
	Запрос.УстановитьПараметр("Дата", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	
	РезультатЗапроса = Запрос.Выполнить();
	ЕСЛИ НЕ РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;					
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщить("Мало товара " + ВыборкаДетальныеЗаписи.ТоварПредставление + ", необходимо еще " + (- ВыборкаДетальныеЗаписи.КоличествоОстаток))
		КонецЦикла;
		
	КонецЕсли;
	
	Движения.Продажи.Записать();
	
	
	Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	ЗагрузкаТоваровВАвтолавкуСписокТоваров.Товар КАК Товар,
		 |	ЗагрузкаТоваровВАвтолавкуСписокТоваров.Количество КАК Количество,
		 |	ЗагрузкаТоваровВАвтолавку.НомерПутевогоЛиста КАК НомерПутевогоЛиста
		 |ИЗ
		 |	Документ.ЗагрузкаТоваровВАвтолавку.СписокТоваров КАК ЗагрузкаТоваровВАвтолавкуСписокТоваров
		 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗагрузкаТоваровВАвтолавку КАК ЗагрузкаТоваровВАвтолавку
		 |		ПО ЗагрузкаТоваровВАвтолавкуСписокТоваров.Ссылка = ЗагрузкаТоваровВАвтолавку.Ссылка";
	РезультатЗапроса = Запрос.Выполнить();
	 
	ВыборкаД = РезультатЗапроса.Выбрать();
	Движения.ТоварыНаСкладе.Записывать = Истина;
	Движения.ТоварыНаСкладе.БлокироватьДляИзменения = Истина;
	
	Пока ВыборкаД.Следующий() Цикл
		Если ВыборкаД.НомерПутевогоЛиста = ЭтотОбъект.НомерПутевогоЛиста Тогда
			Для Каждого ТекСтрокаСписокТоваров Из СписокТоваров Цикл
				Если ВыборкаД.Товар = ТекСтрокаСписокТоваров.Товар Тогда
					Движение = Движения.ТоварыНаСкладе.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.Товар = ТекСтрокаСписокТоваров.Товар;
					Движение.Количество = ВыборкаД.Количество - ТекСтрокаСписокТоваров.Количество;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;	

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗагрузкаТоваровВАвтолавку") Тогда
		НомерПутевогоЛиста = ДанныеЗаполнения.НомерПутевогоЛиста;
		Для Каждого ТекСтрокаСписокТоваров Из ДанныеЗаполнения.СписокТоваров Цикл
			НоваяСтрока = СписокТоваров.Добавить();
			НоваяСтрока.Товар = ТекСтрокаСписокТоваров.Товар;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


