
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ГрафикПоездки") Тогда
		// Заполнение шапки
		НомерГрафика = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТочкиМаршрута Из ДанныеЗаполнения.ТочкиМаршрута Цикл
			НоваяСтрока = СписокТочек.Добавить();
			НоваяСтрока.ВремяОтбытияПоГрафику = ТекСтрокаТочкиМаршрута.ВремяОтбытия;
			НоваяСтрока.ВремяПрибытияПоГрафику = ТекСтрокаТочкиМаршрута.ВремяПрибытия;
			НоваяСтрока.ТочкаМаршрута = ТекСтрокаТочкиМаршрута.ТочкаМаршрута;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
