
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ГрафикПоездки") Тогда
		ГрафикПоездки = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТочкиМаршрута Из ДанныеЗаполнения.ТочкиМаршрута Цикл
			НоваяСтрока = СписокТочек.Добавить();
			НоваяСтрока.ВремяОтбытияПоГрафику = ТекСтрокаТочкиМаршрута.ВремяОтбытия;
			НоваяСтрока.ВремяПрибытияПоГрафику = ТекСтрокаТочкиМаршрута.ВремяПрибытия;
			НоваяСтрока.ТочкаМаршрута = ТекСтрокаТочкиМаршрута.ТочкаМаршрута;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	Движения.ЗатратыГСМ.Записывать = Истина;
	Движение = Движения.ЗатратыГСМ.Добавить();
	Движение.Период = Дата;
	Движение.ПутевойЛист = Ссылка;
	Движение.НормативГСМ = НормативГСМ;
	Движение.ЗатратыГСМ = ОстатокГорючегоПриВыезде-ОстатокГорючегоПоВозвращении;
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ГрафикПоездки.Водитель.Ссылка КАК ВодительСсылка,
	                |	ГрафикПоездки.Ссылка КАК Ссылка,
	                |	ГрафикПоездки.Маршрут.ДлинаМаршрута КАК МаршрутДлинаМаршрута,
	                |	ГрафикПоездки.Водитель.ЗакрепленнаяМашина.Ссылка КАК ВодительЗакрепленнаяМашинаСсылка,
	                |	НормативыРасходаГСМ.КодТС.Ссылка КАК КодТССсылка,
	                |	НормативыРасходаГСМ.НормативРасходаТоплива КАК НормативРасходаТоплива
	                |ИЗ
	                |	Документ.ГрафикПоездки КАК ГрафикПоездки,
	                |	Справочник.НормативыРасходаГСМ КАК НормативыРасходаГСМ";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НормативГСМ = (Выборка.МаршрутДлинаМаршрута / 100 ) * Выборка.НормативРасходаТоплива;
	КонецЦикла;
КонецПроцедуры



