
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
		
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ГрафикПоездки") Тогда
		// Заполнение шапки
		ГрафикПоездки = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТочкиМаршрута Из ДанныеЗаполнения.ТочкиМаршрута Цикл
			НоваяСтрока = СписокТочек.Добавить();
			НоваяСтрока.ВремяОтбытияПоГрафику = ТекСтрокаТочкиМаршрута.ВремяОтбытия;
			НоваяСтрока.ВремяПрибытияПоГрафику = ТекСтрокаТочкиМаршрута.ВремяПрибытия;
			НоваяСтрока.ТочкаМаршрута = ТекСтрокаТочкиМаршрута.ТочкаМаршрута;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЗатратыГСМ 
	Движения.ЗатратыГСМ.Записывать = Истина;
	Движение = Движения.ЗатратыГСМ.Добавить();
	Движение.Период = Дата;
	Движение.ПутевойЛист = Ссылка;
	Движение.НормативГСМ = НормативГСМ;
	Движение.ЗатратыГСМ = ОстатокГорючегоПриВыезде-ОстатокГорючегоПоВозвращении;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
			Запрос = Новый Запрос;
	////Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ГрафикПоездки.Водитель.Ссылка КАК ВодительСсылка,
	                |	ГрафикПоездки.Ссылка КАК Ссылка,
	                |	ГрафикПоездки.Маршрут.ДлинаМаршрута КАК МаршрутДлинаМаршрута,
	                |	ГрафикПоездки.Водитель.ЗакрепленнаяМашина.Ссылка КАК ВодительЗакрепленнаяМашинаСсылка,
	                |	НормативыРасходаГСМ.КодТС.Ссылка КАК КодТССсылка,
	                |	НормативыРасходаГСМ.НормативРасходаТоплива КАК НормативРасходаТоплива
	                |ИЗ
	                |	Документ.ГрафикПоездки КАК ГрафикПоездки,
	                |	Справочник.НормативыРасходаГСМ КАК НормативыРасходаГСМ";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	//ОстатокГорючегоПоВозвращении = Выборка.ОстатокГорючегоПриВыезде;
	Пока Выборка.Следующий() Цикл
		//Сообщить("Результат = " + РезультатЗапроса.Выбрать().ОстатокГорючегоПриВыезде);
	//ДЕБАГ - ТУТ ВЫВОДИТ ПО 2 СООБЩЕНИЯ, НУЖНО УСЛОВИЯ ДОБАВИТЬ
		//Сообщить("Результат = " + Выборка.НормативРасходаТоплива);
		НормативГСМ = (Выборка.МаршрутДлинаМаршрута / 100 ) * Выборка.НормативРасходаТоплива;
	КонецЦикла;
КонецПроцедуры



